overset_plate_motion/overPimpleDyMFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          174;
        startFace       164546;
    }
    outlet
    {
        type            patch;
        nFaces          174;
        startFace       164720;
    }
    topAndBottom
    {
        type            patch;
        nFaces          120;
        startFace       164894;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          165360;
        startFace       165014;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          280;
        startFace       330374;
    }
    overSetPatch
    {
        type            overset;
        inGroups        1(overset);
        nFaces          1240;
        startFace       330654;
    }
)

// ************************************************************************* //
