overset_plate_motion/overPimpleDyMFoam/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicOversetFvMesh;

motionSolverLibs (fvMotionSolvers);

//solver          displacementLaplacian;
solver          multiSolidBodyMotionSolver;

displacementLaplacianCoeffs
{
    diffusivity     uniform 1;
}

multiSolidBodyMotionSolverCoeffs
{
    plate1
    {
     solidBodyMotionFunction linearMotion;
     linearMotionCoeffs
     {
         velocity (3 0 0);
     }


    }
    plate2
    {
     solidBodyMotionFunction linearMotion;
     linearMotionCoeffs
     {
         velocity (-3 0 0);
     }


    }
}
// ************************************************************************* //
